# DIV D
## Последнее умножение
> Найти последнюю цифру выражения `(((...(((a1 ^ a2) ^ a3) ^ ... ak` ( `a1` в
> степени `a2` в степени `a3` и так далее до степени `k` )
> ### Входные данные
> > Первоя строка содержит одно целое число `t` - количество наборов входных
> > данных \
> > Каждый набор входных данных состоит из числа `k` и следующих за ним через
> > пробел `k` целых чисел `a1, a2, ... ak`
> ### Выходные данные
> > Для каждого набора входных данных вывести в строке одну цифру - последюю
> > цифру выражения `a` в степени `b`
> ### Ограничения
> > ```
> > t < 10^5
> > k < 100
> > ai < 10^18
> > ```
> > Память - O(1) \
> > Время - O(t * k)
> ### Примеры
> - Пример 1
> > Входные данные
> > ```
> > 1
> > 2 3 100
> > ```
> > Выходные данные
> > ```
> > 1
> > ```
> - Пример 2
> > Входные данные
> > ```
> > 2
> > 3 3 3 3
> > 5 2 2 2 2 2
> > ```
> > Выходные данные
> > ```
> > 3
> > 6
> > ```
> ### Пояснение к примерам
> Пример 1
> > в примере 1 требуется найти последнюю цифру выражения `3 ^ 100` .
> > Посчитав значение
> > `3 ^ 100 = 515377520732011331036461129765621272702107522001` видим, что
> > последняя цифра выражения равна `1`
> Пример 2
> > в примере 2 требуется найти последнюю цифру выражений `(3 ^ 3) ^ 3` и
> > `(((2 ^ 2) ^ 2) ^ 2) ^ 2` . Посчитав значение выражений
> > `(3 ^ 3) ^ 3 = 19683` и `(((2 ^ 2) ^ 2) ^ 2) ^ 2 = 65536` видно, что ответ
> > `3` и `6`
> ### Решение
> > Заметим, что на последнюю цифру произведения влияют только последние цифры
> > множителей. Кроме того возводя число в степень можно заметить, что последние
> > цифры полученных чисел повторяются через некоторое количество, таким
> > образом, нам достаточно посчитать длину этих циклов для каждой от 0 до 9
> > цифр. Теперь надо узнать на каком месте цикла мы остановимся после
> > возведения числа в степень - это будет остаток от деления степени на длину
> > цикла. Таким образом мы найдем последнюю цифру от возведения в степень двух
> > чисел, теперь надо проделать ту же операцию для каждого из чисел `ai`
> ### Код
> - Python:
> ```python
> print('Hello, world!')
> ```
> - C++:
> ```c++
> cout << "Hello, world!";
> ```

# DIV C
## Нулёвый факториал
> Найти количество нулей в конце числа `n!` ( `n` [факториал][1] ) \
> Или более формально - найти правый индекс первой ненулевой цифры выражения `n!`
> ### Входные данные
> > Первоя строка содержит одно целое число `t` - количество входных данных \
> > Следующие `t` строк содержат по одному числу `n`
> ### Выходные данные
> > Для каждого набора входных данных вывести в строке одно число - количество нулей в конце числа `n!`
> ### Ограничения
> > ```
> > n < 10^18
> > t < 10^5
> > ```
> > Память - O(1) \
> > Время - O(t)

[1]: https://ru.wikipedia.org/wiki/%D0%A4%D0%B0%D0%BA%D1%82%D0%BE%D1%80%D0%B8%D0%B0%D0%BB
